# Importing Libraries

In [1]:
#importing libraries
import pandas as pd
import numpy as np
import os

In [2]:
df_travel = pd.read_csv(r'C:\Users\makay\Documents\Data Immersion 6\6.1 assignment.csv',index_col = False)

In [3]:
df_travel.dtypes

Trip ID                   int64
Destination              object
Start date               object
End date                 object
Duration (days)           int64
Traveler name            object
Traveler age              int64
Traveler gender          object
Traveler nationality     object
Accommodation type       object
Accommodation cost       object
Transportation type      object
 Transportation cost     object
dtype: object

In [4]:
df_travel.shape

(137, 13)

In [5]:
df_travel.head()

,Trip ID,Destination,Start date,End date,Duration (days),Traveler name,Traveler age,Traveler gender,Traveler nationality,Accommodation type,Accommodation cost,Transportation type,Transportation cost
0,1,"London, United Kingdom",5/1/2023,5/8/2023,7,John Smith,35,Male,American,Hotel,"$1,200.00",Flight,$600.00
1,2,"Phuket, Thailand",6/15/2023,6/20/2023,5,Jane Doe,28,Female,Canadian,Resort,$800.00,Flight,$500.00
2,3,"Bali, Indonesia",7/1/2023,7/8/2023,7,David Lee,45,Male,Korean,Villa,"$1,000.00",Flight,$700.00
3,4,"New York, United States of America",8/15/2023,8/29/2023,14,Sarah Johnson,29,Female,British,Hotel,"$2,000.00",Flight,"$1,000.00"
4,5,"Tokyo, Japan",9/10/2023,9/17/2023,7,Kim Nguyen,26,Female,Vietnamese,Airbnb,$700.00,Train,$200.00

In [6]:
#Check for missing values

df_travel.isnull().sum()

Trip ID                  0
Destination              0
Start date               0
End date                 0
Duration (days)          0
Traveler name            0
Traveler age             0
Traveler gender          0
Traveler nationality     0
Accommodation type       0
Accommodation cost       0
Transportation type      1
 Transportation cost     1
dtype: int64

1 missing value in transportation type and cost

In [7]:
df_dups = df_travel[df_travel.duplicated()]

In [8]:
df_dups.shape

(0, 13)

No duplicates found